'use strict';

// Выведите чётные числа
// При помощи цикла for выведите чётные числа от 2 до 10.

// for (let i = 1; i < 11; i++) {
//     if (i % 2 === 0) console.log(i);
// }
// ==================================================================================================== //
// Замените for на while
// Перепишите код, заменив цикл for на while, без изменения поведения цикла.
//
// for (let i = 0; i < 3; i++) {
//     alert( `number ${i}!` );
// }

// let i = 0;
// while (i < 3) {
//     console.log(`number ${i}`);
//     i++;
// }
// ==================================================================================================== //
// Функция pow(x,n)
// важность: 4
// Напишите функцию pow(x,n), которая возвращает x в степени n. Иначе говоря, умножает x на себя n раз и возвращает результат.
// pow(3, 2) = 3 * 3 = 9
// pow(3, 3) = 3 * 3 * 3 = 27
// pow(1, 100) = 1 * 1 * ...* 1 = 1
// Создайте страницу, которая запрашивает x и n, а затем выводит результат pow(x,n).

// function pow(x, n) {
//     let result = x;
//
//     for (let i = 1; i < n; i++) {
//         result *= x;
//     }
//
//     return result;
// }
//
// let x = prompt("x?", '');
// let n = prompt("n?", '');
//
// if (n < 1) {
//     alert(`Степень ${n} не поддерживается, используйте натуральное число`);
// } else {
//     alert( pow(x, n) );
// }
// ==================================================================================================== //
// Функция min(a, b)
// важность: 1
// Напишите функцию min(a,b), которая возвращает меньшее из чисел a и b.
// Пример вызовов:
// min(2, 5) == 2
// min(3, -1) == -1
// min(1, 1) == 1
// let min = (a, b) => a < b ? a : b;
// console.log(min(2, 5));
// console.log(min(3, -1));
// console.log(min(1, 1));
// ==================================================================================================== //
// Сумма свойств объекта
// У нас есть объект, в котором хранятся зарплаты нашей команды:
// Напишите код для суммирования всех зарплат и сохраните результат в переменной sum. Должно получиться 390.
// Если объект salaries пуст, то результат должен быть 0.

// let salaries = {
//     John: 100,
//     Ann: 160,
//     Pete: 130
// };
// let sum = 0;
// for (let key in salaries) {
//     sum += salaries[key];
// }
//
// console.log(sum);
// ==================================================================================================== //
// Умножаем все числовые свойства на 2
// Создайте функцию multiplyNumeric(obj), которая умножает все числовые свойства объекта obj на 2.

// let menu = {
//     width: 200,
//     height: 300,
//     title: "My menu",
//     num: 1000
// };

//
// function multiplyNumeric(obj) {
//     for (let key in obj) {
//         if (typeof obj[key] === 'number') {
//             obj[key] *= 2;
//         }
//     } return obj;
// }
//
// console.log(multiplyNumeric(menu));
// ==================================================================================================== //
// Создайте объект calculator (калькулятор) с тремя методами:
//
//     read() (читать) запрашивает два значения и сохраняет их как свойства объекта.
// sum() (суммировать) возвращает сумму сохранённых значений.
// mul() (умножить) перемножает сохранённые значения и возвращает результат.
//     let calculator = {
//     // ... ваш код ...
// };
// let calculator = {
//     read() {
//         this.a = +prompt('a?', '0');
//         this.b = +prompt('b?', '0');
//     },
//     sum() {
//         return this.a + this.b;
//     },
//     mul() {
//         return this.a * this.b;
//     }
// };
//
// calculator.read();
// console.log( calculator.sum() );
// console.log( calculator.mul() );
// ==================================================================================================== //
// Создайте функцию-конструктор Calculator, который создаёт объекты с тремя методами:
//
//     read() запрашивает два значения при помощи prompt и сохраняет их значение в свойствах объекта.
// sum() возвращает сумму введённых свойств.
// mul() возвращает произведение введённых свойств.
//     Например:
// function Calculator() {
//     this.read = function () {
//         this.a = +prompt('a?', '0');
//         this.b = +prompt('b?', '0');
//     };
//     this.sum = function () {
//         return this.a + this.b;
//     };
//     this.mul = function () {
//         return this.a * this.b;
//     };
// }
//
// let calculator = new Calculator();
// calculator.read();
//
// console.log( "Sum=" + calculator.sum() );
// console.log( "Mul=" + calculator.mul() );
// ==================================================================================================== //
// Напишите функцию checkSpam(str), возвращающую true, если str содержит 'viagra' или 'XXX', а иначе false.
//
//     Функция должна быть нечувствительна к регистру:
// function checkSpam(str) {
//     return (str.toLowerCase().includes('viagra') || str.toLowerCase().includes('xxx'));
// }
//
// console.log(checkSpam('buy ViAgRA now'));
// console.log(checkSpam('free xxxxx'));
// console.log(checkSpam("innocent rabbit"));
// ==================================================================================================== //
// Напишите функцию ucFirst(str), возвращающую строку str с заглавным первым символом.
//     Например: ucFirst("вася") == "Вася";
// function ucFirst(str) {
//     if (!str) return str;
//     return str[0].toUpperCase() + str.slice(1).toLowerCase();
// }
//
// console.log(ucFirst("ВАСЯ"));
// console.log(ucFirst("максим"));
// console.log(ucFirst(""));
// ==================================================================================================== //
// Создайте функцию truncate(str, maxlength), которая проверяет длину строки str и, если она превосходит maxlength, заменяет конец str на "…", так, чтобы её длина стала равна maxlength.
//
//     Результатом функции должна быть та же строка, если усечение не требуется, либо, если необходимо, усечённая строка.
//
//     Например:
//
// truncate("Вот, что мне хотелось бы сказать на эту тему:", 20) = "Вот, что мне хотело…"
//
// truncate("Всем привет!", 20) = "Всем привет!"

function truncate(str, maxlength) {
    
}
// ==================================================================================================== //

// ==================================================================================================== //

// ==================================================================================================== //

// ==================================================================================================== //

// ==================================================================================================== //

// ==================================================================================================== //

// ==================================================================================================== //

// ==================================================================================================== //

// ==================================================================================================== //

// ==================================================================================================== //
// ==================================================================================================== //
// ==================================================================================================== //